Ryan365Apps/spotify-knob/firmware/knob/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash, custom table with room for OTA later
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 8 MB octal PSRAM - album art cannot exist without this
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# HTTPS to Spotify without pinning certificates by hand
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# Dynamic mbedTLS buffers are deliberately OFF (2026-09-03). They are meant to
# save RAM by allocating TLS buffers only while they are needed, but with this
# workload - one long-lived connection polled every few seconds - roughly 5-7 KB
# went missing per request and never came back, taking the device from 80 KB
# free to 5 KB in two minutes. The failing allocation named the culprit:
# "Dynamic Impl: alloc(4437 bytes) failed". Fixed buffers cost more at rest and
# are constant, which is the trade this device wants: it holds one connection
# for days. Do not re-enable without measuring free heap over ten minutes.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=n

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_COLOR_DEPTH_16=y

# The type ramp. Everything on a 46 mm screen read too small on hardware
# (2026-09-03) at the sizes the design's pixel figures implied, because those
# figures were set against a monitor showing the panel at roughly twice life
# size. 24/28 carry titles and names, 36 the transport icons, 48 the dial
# value. Adding a size costs flash, not RAM.
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Wave 3: wifi/ip event handlers live on this task; default 2304 overflowed
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Wave 3 checkpoint E / Wave 9: QR codes on the panel
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_FONT_MONTSERRAT_20=y

# Wave 8: a wedge has to recover on its own.
#
# The task watchdog was already initialised and already watching the idle task
# on both cores - that is what caught the first bloom implementation starving
# LVGL (2026-09-03). But CONFIG_ESP_TASK_WDT_PANIC was off, so all it did was
# print a backtrace every few seconds while the device stayed wedged. With
# panic on, and the panic handler set to reboot, a wedge costs a reboot instead
# of a power cycle. The timeout is raised from 5 s to 10 s so only a genuine
# wedge trips it: the longest single piece of work in this firmware is a JPEG
# decode at 140-220 ms, so ten seconds is two orders of magnitude of headroom.
#
# The one-second reboot delay exists so the backtrace actually reaches the
# serial monitor before the chip resets - with no delay the tail of it is lost,
# which is the only part worth having.
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=1
